[
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/delhi-govt-takes-job-steps-for-disabled-aspirants/articleshow/104663808.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104663808,width-300,resizemode-4/104663808.jpg",
    "title": "Delhi govt takes job steps for disabled aspirants",
    "time": "TNN / Oct 24, 2023, 08:04 (IST)",
    "article": "The Delhi government has begun the process of filling vacancies for persons with disabilities, as there is a backlog of 2,193 posts in various departments. The Delhi High Court has directed a special recruitment drive to fill these vacancies in a time-bound manner and has entrusted the state commissioner for persons with disabilities with the responsibility of monitoring the drive. Requisitions are being sent to the Union Public Service Commission and Delhi Subordinate Services Selection Board to fill the vacancies. The government is following the court's directions and has initiated the process to fill the vacancies."
  },
  {
    "link": "https://timesofindia.indiatimes.com/home/science/brain-tumours-can-bring-long-term-disability-but-some-diagnosed-are-being-refused-ndis-support/articleshow/104817493.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104817493,width-300,resizemode-4/104817493.jpg",
    "title": "Brain tumours can bring long-term disability- but some diagnosed are being refused NDIS support",
    "time": "PTI / Oct 30, 2023, 12:36 (IST)disability",
    "article": "The ABC is reporting how terminally ill patients are being left in limbo as the states and the National disability Insurance Scheme (NDIS) argue over disability supports. ​​The reports share the experiences of Australians with brain tumours and highlight the distress of getting a diagnosis, as well as the lack of support people can experience. Those living with what is at once a serious illness, disability and a potentially life-limiting condition can be caught between the NDIS, the health system and palliative care."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/challenges-faced-by-students-with-disabilities-in-delhi-university-campus-law-centre/articleshow/105303743.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105303743,width-300,resizemode-4/105303743.jpg",
    "title": "Ground reality: From getting there to being on campus, it’s a daily challenge",
    "time": "TNN / Nov 18, 2023, 08:10 (IST)",
    "article": "Students with disabilities at Delhi University's Campus Law Centre face numerous challenges due to the campus infrastructure. The entrance lacks tactile flooring and indicators, making it difficult for visually impaired and wheelchair users to navigate. The college also lacks designated parking spaces and has inadequate facilities for disabled individuals. Additionally, there are accessibility issues with classrooms, restrooms, and case materials. Despite a court order to implement accessibility guidelines, the college has yet to address these issues fully. Renovations have been made, but infrastructural problems, such as broken facilities and nonfunctional lifts, remain."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/goa/multi-sensory-play-park-for-kids-with-disabilities-in-panaji/articleshow/105518832.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Multi-sensory play park for kids with disabilities in Panaji",
    "time": "Nov 27, 2023, 04:41 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/raipur/disability-rights-ignored-divyang-voters-struggle-to-reach-polling-booths-in-raipur/articleshow/105289607.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "disability rights ignored: Divyang voters struggle to reach polling booths in Raipur",
    "time": "TNN / Nov 17, 2023, 15:41 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/hyderabad/hc-slams-t-govt-tspsc-over-lack-of-facilities-for-disabled/articleshow/105275628.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "HC slams T govt, TSPSC over lack of facilities for disabled",
    "time": "Nov 17, 2023, 08:20 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/mumbai/official-suspended-for-sending-disabled-woman-to-2nd-floor/articleshow/104741055.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Official suspended for sending disabled woman to 2nd floor",
    "time": "TNN / Oct 27, 2023, 08:14 (IST)",
    "article": "A marriage registrar in Maharashtra, India has been suspended after a disability rights activist, Virali Modi, had to be carried up two flights of stairs to register her marriage. The registrar, Arun Ghodekar, allegedly refused to come down to collect Modi's signature, stating that he needed his computer to complete the registration process. The state government has suspended Ghodekar pending a full inquiry, while Modi has called for greater accessibility in public buildings."
  },
  {
    "link": "https://timesofindia.indiatimes.com/etimes/trending/indigo-airlines-faces-backlash-over-neglecting-a-passenger-with-disabilities/articleshow/105783135.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Indigo airlines faces backlash over neglecting a passenger with disabilities",
    "time": "TIMESOFINDIA.COM / Dec 06, 2023, 17:00 (IST)",
    "article": "Indigo Airlines is under scrutiny following an altercation with a disabled passenger, leading to a critical Instagram post."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/lucknow/up-is-the-only-state-in-country-to-have-2-varsities-for-disabled-cm/articleshow/105712741.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105712741,width-300,resizemode-4/105712741.jpg",
    "title": "UP is the only state in country to have 2 varsities for disabled: CM",
    "time": "TNN / Dec 04, 2023, 08:23 (IST)",
    "article": "Chief Minister Yogi Adityanath stated that Uttar Pradesh has two universities for physically challenged people, DSMNRU and Jagatguru Divyang University. The state invested Rs 1,120 crore in disabled welfare schemes. Para-athletes in China won 111 medals, demonstrating the talent of divyang people. The government has established three shelter homes for the mentally challenged and plans to open six more. Monthly pension for disabled persons has been increased to Rs 1,000, and leprosy sufferers now receive Rs 3,000. The government has distributed artificial limbs, motorized tricycles, and provided marriage incentives. Financial assistance of up to Rs 6 lakh is offered for cochlear implant surgery."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/delhi-how-these-warriors-turned-disabilities-into-strengths/articleshow/104299719.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104299719,width-300,resizemode-4/104299719.jpg",
    "title": "Delhi: How these warriors turned disabilities into strengths",
    "time": "TNN / Oct 10, 2023, 08:48 (IST)",
    "article": "Mallikarjuna Iytha, the founder of IDEA-Saksham, an NGO that trains persons with disabilities (PWDs) to become entrepreneurs, was awarded for his entrepreneurship skills by the Delhi government. In addition to Iytha, 11 other PWDs were honored for excellence in various domains, four paralympic athletes were felicitated, and two hospitals specializing in services for PWDs were recognized. Delhi Chief Minister Arvind Kejriwal also launched a mobile app called 'Dharohar' to provide important notifications to pension beneficiaries. The event aimed to acknowledge the achievements of individuals with disabilities and their determination to make a positive impact on society."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chennai/train-stations-to-be-disabled-friendly/articleshow/104226926.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104226926,width-300,resizemode-4/104226926.jpg",
    "title": "Train stations to be disabled-friendly",
    "time": "TNN / Oct 07, 2023, 06:53 (IST)",
    "article": "Southern Railway has announced that it will audit railway stations, including major ones like Chennai Central and Egmore, due to concerns raised about design errors that affect disabled passengers. The audit is in response to complaints about the lack of tactile paths for visually impaired passengers, ramps without landings, and inaccessible toilets for wheelchair users. As part of a modernization effort, the railway will provide guiding braille indicators, reflective strips on stairs, sign language videos linked to QR codes, portable ramps, and wheelchairs. The aim is to make transportation more inclusive and accessible."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/obese-soldier-cant-get-disability-pension-for-bp-diabetes-aft/articleshow/104435622.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104435622,width-300,resizemode-4/104435622.jpg",
    "title": "Obese soldier can't get disability pension for BP, diabetes: AFT",
    "time": "TNN / Oct 15, 2023, 09:28 (IST)disability",
    "article": "The Armed Forces Tribunal (AFT) has ruled that soldiers who suffer from diabetes and hypertension due to being overweight or obese will not be eligible for disability pension. The AFT stated that there is no causal connection between these conditions and military service. The ruling came after examining the Body Mass Index (BMI) of an IAF personnel and comparing it with the World Health Organization's weight/BMI parameters. The tribunal cited the applicant's weight record and BMI, which were well above the normal limit, as reasons for denying disability pension."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chennai/nominations-invited-for-cavinkare-ability-award-2023/articleshow/104908892.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Nominations invited for CavinKare Ability Award 2024",
    "time": "TNN / Nov 02, 2023, 12:24 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/bjps-fake-nationalism-visible-yet-again-kharge-on-new-disability-pension-rules-for-armed-forces/articleshow/104063648.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104063648,width-300,resizemode-4/104063648.jpg",
    "title": "BJP's 'fake nationalism' visible yet again: Kharge on new disability pension rules for armed forces",
    "time": "PTI / Sep 30, 2023, 13:50 (IST)",
    "article": "Congress chief Mallikarjun Kharge slammed BJP's new disability pension rules for armed forces personnel, accusing them of \"fake nationalism.\" The All India Ex-Servicemen Welfare Association has protested against the new policy, which was made public by the Ministry of Defence. Kharge claimed that the policy would disadvantage soldiers compared to civilian employees and violate past judgments and global norms."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/shimla/ex-gratia-hiked-for-dependents-of-martyred-disabled-soldiers/articleshow/104810988.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Ex-gratia hiked for dependents of martyred, disabled soldiers",
    "time": "TNN / Oct 30, 2023, 08:37 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/nagpur/parents-mowed-down-teen-with-disabilities-stares-at-dark-future-after-miracle-escape/articleshow/105689031.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105689031,width-300,resizemode-4/105689031.jpg",
    "title": "Parents mowed down, teen with disabilities stares at dark future after miracle escape",
    "time": "TNN / Dec 03, 2023, 05:18 (IST)",
    "article": "A 13-year-old girl with physical and mental disabilities survived a road accident on the Nagpur-Wardha highway. Her parents were tragically mowed down by a speeding truck while they were on their way to a physiotherapy session. The girl was thrown away upon impact, while the truck dragged the bike and her parents for over 50 meters. The girl is in deep shock, mourning the loss of her parents who sacrificed everything for her."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/devices-passes-given-to-people-with-disabilities/articleshow/104621276.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104621276,width-300,resizemode-4/104621276.jpg",
    "title": "Devices, passes given to people with disabilities",
    "time": "TNN / Oct 22, 2023, 10:47 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/agra/disabled-at-3-farmers-son-bags-javelin-bronze/articleshow/104767964.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104767964,width-300,resizemode-4/104767964.jpg",
    "title": "Disabled at 3, farmer's son bags javelin bronze",
    "time": "TNN / Oct 28, 2023, 07:11 (IST)",
    "article": "Pushpendra Singh, a 23-year-old from a remote village in Uttar Pradesh, won a bronze medal in the men's javelin event at the Asian Para Games 2023 in China. Despite developing leg deformities at a young age, Pushpendra excelled in the sport, impressing a coach with his throwing strength. His family faced challenges in getting him in shape, but his dedication and hard work paid off. Prime Minister Narendra Modi congratulated Pushpendra on his achievement and praised his exceptional performance."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/new-scheme-to-offer-free-equipment-to-the-disabled/articleshow/104823291.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104823291,width-300,resizemode-4/104823291.jpg",
    "title": "New scheme to offer free equipment to the disabled",
    "time": "TNN / Oct 30, 2023, 15:28 (IST)",
    "article": "The Delhi government is set to provide free equipment to people with disabilities under the Sugamya Sahayak Yojana. The social welfare department has compiled a list of 20 types of equipment, including motorised tricycles and artificial limbs. The government has finalised an agreement with the Artificial Limbs Manufacturing Corporation Of India and allocated a budget of over Rs 10 crore for the purchase of the equipment. The distribution will take place through camps held in each administrative district of Delhi. The scheme will be launched in November and will cover 40% or more disabled individuals."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chennai/fire-free-cooking-contest-to-be-conducted-in-chennai/articleshow/104760737.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Fire-free cooking contest to be conducted in Chennai",
    "time": "TNN / Oct 27, 2023, 19:38 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/gadgets-news/apples-short-film-showcases-accessibility-features-and-how-they-help-users-with-disabilities-communicate/articleshow/105633915.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105633915,width-300,resizemode-4/105633915.jpg",
    "title": "Apple's short film showcases accessibility features and how they help users with disabilities communicate",
    "time": "TIMESOFINDIA.COM / Nov 30, 2023, 21:32 (IST)",
    "article": "Apple releases Lost Voice ad film to mark International Day for People with Disabilities, showcasing accessibility features of iOS 17. The film tells the story of a young girl and her pink, floppy-eared furry friend as they search for his missing voice. The ad highlights Personal Voice, a feature that uses secure on-device machine learning to recreate a user's voice. It features Dr Tristram Ingham, a disability advocate with FSHD, using his own Personal Voice created on iPhone. Directed by Taika Waititi, the film was shot in New Zealand's natural landscapes."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/dehradun/disabled-shooter-from-doon-bags-2-golds-1-silver-at-national-shooting-championship/articleshow/105747116.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105747116,width-300,resizemode-4/105747116.jpg",
    "title": "Disabled shooter from Doon bags 2 golds, 1 silver at national shooting championship",
    "time": "TNN / Dec 05, 2023, 12:06 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chennai/three-disabled-children-run-over-by-train-in-chennai/articleshow/104675114.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104675114,width-300,resizemode-4/104675114.jpg",
    "title": "Three disabled children run over by train in Chennai",
    "time": "TNN / Oct 24, 2023, 17:17 (IST)",
    "article": "The deceased have been identified as Manjunath, 11, Ravi, 12, and Suresh, 14. They hailed from Hubli in Karnataka."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/how-these-kids-are-finding-their-feet-with-special-help/articleshow/103643576.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103643576,width-300,resizemode-4/103643576.jpg",
    "title": "Delhi: How these kids are finding their feet with special help",
    "time": "TNN / Sep 14, 2023, 04:40 (IST)",
    "article": "The parents of Shubham Kumar, a 14-year-old private school student with disabilities, fretted over his refusal to let go of his father’s hand whenever they went out."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/chandigarh/group-home-for-mentally-ill-to-start-by-next-year/articleshow/104618655.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Group home for mentally ill to start by next year",
    "time": "Oct 22, 2023, 08:37 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/life-style/parenting/dyslexia-how-parents-can-change-the-narrative/articleshow/104618373.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104618373,width-300,resizemode-4/104618373.jpg",
    "title": "DYSLEXIA: How parents can change the narrative",
    "time": "Oct 22, 2023, 08:27 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/life-style/parenting/attention-please-why-parents-shouldnt-get-hyper-about-adhd/articleshow/104618112.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104618112,width-300,resizemode-4/104618112.jpg",
    "title": "ATTENTION PLEASE! Why parents shouldn’t get hyper about ADHD",
    "time": "TNN / Oct 22, 2023, 08:18 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/home/sunday-times/dyslexia-how-parents-can-change-the-narrative/articleshow/104612521.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104612521,width-300,resizemode-4/104612521.jpg",
    "title": "Dyslexia: How parents can change the narrative",
    "time": "TNN / Oct 22, 2023, 04:00 (IST)",
    "article": "World Dyslexia Awareness Month is a time to focus on the inclusion of learners with neurodiverse needs in schools and colleges. Neurodiversity recognizes that every individual thinks, learns, and behaves differently, and there is no one \"right\" way to learn. Specific Learning Disabilities (SLDs) like dyslexia, dyscalculia, and dysgraphia present hidden learning challenges. Students with SLDs often face stigma and are labeled as lazy or slow learners. It is crucial for parents to accept and understand their child's learning differences and build their confidence"
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/disability-rights-bodies-slam-a-raja/articleshow/103522693.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103522693,width-300,resizemode-4/103522693.jpg",
    "title": "disability rights bodies slam A Raja",
    "time": "TNN / Sep 09, 2023, 06:52 (IST)",
    "article": "disability rights organisations have objected to DMK MP A Raja's remarks equating Sanatan Dharma with HIV and leprosy. The Leprosy Mission Trust India, in a letter to Raja, has asked him to reconsider his statement and \"publicly apologise for any harm caused\"."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/mumbai/no-lift-at-khar-office-disabled-activist-carried-up-2-floors-to-register-marriage/articleshow/104540601.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104540601,width-300,resizemode-4/104540601.jpg",
    "title": "No lift at Khar office, disabled activist carried up 2 floors to register marriage",
    "time": "TNN / Oct 19, 2023, 08:14 (IST)",
    "article": "A disability rights activist in Mumbai had to be carried up two flights of stairs to register her marriage due to the lack of infrastructure for disabled persons in government offices. The incident highlighted the struggles faced by cash-starved PSUs in meeting basic requirements for accessibility. The activist questioned the effectiveness of the Centre's Accessible India campaign. The sub-registrar's office where the incident occurred is in a building belonging to MTNL, which is under dissolution and lacks a working lift. The incident raised discussions on the impact of the term 'divyang' on the lives of disabled citizens."
  }
]