[
  {
    "link": "https://timesofindia.indiatimes.com/india/govt-pushes-for-make-in-india-in-diagnostics-rolls-out-iq-test-to-assess-intellectual-disability/articleshow/105921041.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105921041,width-300,resizemode-4/105921041.jpg",
    "title": "Govt pushes for \"Make in India' in diagnostics, rolls out IQ test to assess intellectual disability  Govt pushes for \"Make in India' in diagnostics, rolls out IQ test to assess intellectual disability  The government has introduced the 'Indian Test of Intelligence' to assess intellectual disability. This IQ assessment test kit, developed by NIEPID, is approved for issuing Unique Disability Identity certificates. The minister handed out UDID cards to children who underwent the test. This test kit will promote 'Make In India' diagnostics and be accessible to trained Indian psychologists. NIEPID's test is based on knowledge, reasoning, quantitative reasoning, spatial reasoning, and working memory, suitable for children aged 3-18.",
    "time": "TIMESOFINDIA.COM / Dec 12, 2023, 10:42 (IST)",
    "article": "The government has introduced the 'Indian Test of Intelligence' to assess intellectual disability. This IQ assessment test kit, developed by NIEPID, is approved for issuing Unique Disability Identity certificates. The minister handed out UDID cards to children who underwent the test. This test kit will promote 'Make In India' diagnostics and be accessible to trained Indian psychologists. NIEPID's test is based on knowledge, reasoning, quantitative reasoning, spatial reasoning, and working memory, suitable for children aged 3-18."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/cities-can-but-lack-will-to-be-disability-friendly/articleshow/105684735.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105684735,width-300,resizemode-4/105684735.jpg",
    "title": "Cities can but lack will to be disability-friendly  Cities can but lack will to be disability-friendly  On International Day Of Persons With Disabilities, TOI Takes A Hard Look At How Far The Accessible India Campaign Has Come Since Its 2015 Launch. While Public Infrastructure Has Become Inclusive To Some Extent, It’s Clearly Not Enough",
    "time": "TIMESOFINDIA.COM / Dec 02, 2023, 23:54 (IST)",
    "article": "On International Day Of Persons With Disabilities, TOI Takes A Hard Look At How Far The Accessible India Campaign Has Come Since Its 2015 Launch. While Public Infrastructure Has Become Inclusive To Some Extent, It’s Clearly Not Enough"
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/rights-violated-disability-activist-slams-airport-air-india-express/articleshow/106000118.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-106000118,width-300,resizemode-4/106000118.jpg",
    "title": "Rights violated: Disability activist slams airport, Air India Express  Rights violated: Disability activist slams airport, Air India Express",
    "time": "TNN / Dec 14, 2023, 22:32 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/england-physical-disability-team-to-play-five-it20s-in-jan-feb-in-india/articleshow/105631593.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105631593,width-300,resizemode-4/105631593.jpg",
    "title": "England Physical Disability team to play five IT20s in Jan-Feb in India  England Physical Disability team to play five IT20s in Jan-Feb in India  It's not just the England men's cricket team which will be in action in India early next year when it tours the country for a five-Test series. England's Men’s Physical Disability team too will be playing a five I20s series in India in January and February",
    "time": "TNN / Nov 30, 2023, 19:39 (IST)",
    "article": "It's not just the England men's cricket team which will be in action in India early next year when it tours the country for a five-Test series. England's Men’s Physical Disability team too will be playing a five I20s series in India in January and February"
  },
  {
    "link": "https://timesofindia.indiatimes.com/education/news/india-introduces-home-based-schooling-for-children-with-special-needs/articleshow/104999243.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104999243,width-300,resizemode-4/104999243.jpg",
    "title": "India introduces home-based schooling for children with special needs  India introduces home-based schooling for children with special needs  The Department of School Education and Literacy (DSEL) in India is planning to introduce home-based schooling for students with severe disabilities as part of special inclusivity measures. Under the new norms by the NCERT, an itinerant resource teacher will visit the students' homes to provide guidance and support. The initiative aims to help children with special needs, physically challenged students, and those from disadvantaged backgrounds acquire necessary learning levels. Special educators will also be appointed, and regular teachers will receive cross-disability training to better support these students. The guidelines align with the objectives of the National Education Policy (NEP) 2020.",
    "time": "TNN / Nov 06, 2023, 09:52 (IST)",
    "article": "The Department of School Education and Literacy (DSEL) in India is planning to introduce home-based schooling for students with severe disabilities as part of special inclusivity measures. Under the new norms by the NCERT, an itinerant resource teacher will visit the students' homes to provide guidance and support. The initiative aims to help children with special needs, physically challenged students, and those from disadvantaged backgrounds acquire necessary learning levels. Special educators will also be appointed, and regular teachers will receive cross-disability training to better support these students. The guidelines align with the objectives of the National Education Policy (NEP) 2020."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/ahmedabad/cities-can-but-lack-will-to-be-disability-friendly/articleshow/105689785.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Cities can but lack will to be disability-friendly  Cities can but lack will to be disability-friendly  The Accessible India campaign in Gujarat's cities has remained a mixed bag in terms of making physical and digital spaces accessible to people with disabilities (PwDs). While some changes have been made after accessibility audits, compliance with universal accessibility norms is poor. A mobile app developed by Voice of Specially Abled Persons (VoSAP) provides ratings on buildings in Ahmedabad, Surat, Vadodara, and Rajkot, with only 7% receiving '5 star' facilities for PwDs. On average, 62% of buildings are inaccessible. The onus is on everyone to prioritize accessibility for all potential users, beyond PwDs.",
    "time": "TNN / Dec 03, 2023, 07:07 (IST)",
    "article": "The Accessible India campaign in Gujarat's cities has remained a mixed bag in terms of making physical and digital spaces accessible to people with disabilities (PwDs). While some changes have been made after accessibility audits, compliance with universal accessibility norms is poor. A mobile app developed by Voice of Specially Abled Persons (VoSAP) provides ratings on buildings in Ahmedabad, Surat, Vadodara, and Rajkot, with only 7% receiving '5 star' facilities for PwDs. On average, 62% of buildings are inaccessible. The onus is on everyone to prioritize accessibility for all potential users, beyond PwDs."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/16-change-makers-honoured-with-helen-keller-awards-for-strides-towards-inclusivity/articleshow/105863844.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105863844,width-300,resizemode-4/105863844.jpg",
    "title": "16 change-makers honoured with Helen Keller awards for strides towards inclusivity  16 change-makers honoured with Helen Keller awards for strides towards inclusivity  16 individuals and firms honored with the 24th Helen Keller Awards for fostering inclusive work environment and championing integration of disabled individuals into mainstream workforce. Winners from diverse states in India showcased commitment to inclusivity. Awards, a joint initiative of NCPEDP and LTIMindtree, empower PWDs and inspire inclusive job market. Arman Ali, executive director of NCPEDP, emphasized the Awards' role in recognizing individuals and institutions promoting employment, equality, and diversity. Debashis Chatterjee, CEO of LTIMindtree, highlighted the importance of skilling and employment opportunities for disabled individuals to integrate into the mainstream job market.",
    "time": "TIMESOFINDIA.COM / Dec 09, 2023, 17:55 (IST)",
    "article": "16 individuals and firms honored with the 24th Helen Keller Awards for fostering inclusive work environment and championing integration of disabled individuals into mainstream workforce. Winners from diverse states in India showcased commitment to inclusivity. Awards, a joint initiative of NCPEDP and LTIMindtree, empower PWDs and inspire inclusive job market. Arman Ali, executive director of NCPEDP, emphasized the Awards' role in recognizing individuals and institutions promoting employment, equality, and diversity. Debashis Chatterjee, CEO of LTIMindtree, highlighted the importance of skilling and employment opportunities for disabled individuals to integrate into the mainstream job market."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/pune/lack-of-data-on-specially-abled-voters-poses-challenges-for-election-officials/articleshow/105741370.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Only 5.6 lakh specially abled voters registered across state  Only 5.6 lakh specially abled voters registered across state",
    "time": "Dec 05, 2023, 08:49 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/lucknow/up-is-the-only-state-in-country-to-have-2-varsities-for-disabled-cm/articleshow/105714070.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105714070,width-300,resizemode-4/105714070.jpg",
    "title": "UP is the only state in country to have 2 varsities for disabled: CM  UP is the only state in country to have 2 varsities for disabled: CM",
    "time": "TNN / Dec 04, 2023, 08:54 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/president-droupadi-murmu-confers-national-awards-calls-for-inclusive-ecosystem/articleshow/105712020.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105712020,width-300,resizemode-4/105712020.jpg",
    "title": "President Droupadi Murmu confers national awards, calls for inclusive ecosystem  President Droupadi Murmu confers national awards, calls for inclusive ecosystem  Teen Mumbai swimmer Jia Rai, deaf designer Himanshu Kansal, visually impaired Taha ldrees Haaziq, and Amazon India were among the recipients of the annual national awards for persons with disabilities in India. The awards, presented by President Droupadi Murmu, recognized individuals and organizations for their achievements in empowerment and inclusivity. Jia Rai, an open water para swimmer, has achieved national and international fame, while Himanshu Kansal has developed innovative Indian Sign language resources.",
    "time": "TNN / Dec 04, 2023, 07:51 (IST)",
    "article": "Teen Mumbai swimmer Jia Rai, deaf designer Himanshu Kansal, visually impaired Taha ldrees Haaziq, and Amazon India were among the recipients of the annual national awards for persons with disabilities in India. The awards, presented by President Droupadi Murmu, recognized individuals and organizations for their achievements in empowerment and inclusivity. Jia Rai, an open water para swimmer, has achieved national and international fame, while Himanshu Kansal has developed innovative Indian Sign language resources."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/bjps-fake-nationalism-visible-yet-again-kharge-on-new-disability-pension-rules-for-armed-forces/articleshow/104063648.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104063648,width-300,resizemode-4/104063648.jpg",
    "title": "BJP's 'fake nationalism' visible yet again: Kharge on new disability pension rules for armed forces  BJP's 'fake nationalism' visible yet again: Kharge on new disability pension rules for armed forces  Congress chief Mallikarjun Kharge slammed BJP's new disability pension rules for armed forces personnel, accusing them of \"fake nationalism.\" The All India Ex-Servicemen Welfare Association has protested against the new policy, which was made public by the Ministry of Defence. Kharge claimed that the policy would disadvantage soldiers compared to civilian employees and violate past judgments and global norms.",
    "time": "PTI / Sep 30, 2023, 13:50 (IST)",
    "article": "Congress chief Mallikarjun Kharge slammed BJP's new disability pension rules for armed forces personnel, accusing them of \"fake nationalism.\" The All India Ex-Servicemen Welfare Association has protested against the new policy, which was made public by the Ministry of Defence. Kharge claimed that the policy would disadvantage soldiers compared to civilian employees and violate past judgments and global norms."
  },
  {
    "link": "https://timesofindia.indiatimes.com/entertainment/tamil/music/making-a-difference-to-the-margazhi-music-fest-with-inclusivity/articleshow/105647683.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105647683,width-300,resizemode-4/105647683.jpg",
    "title": "Making a difference to the Margazhi music fest with inclusivity  Making a difference to the Margazhi music fest with inclusivity  The event, which puts the spotlight on disabled artistes, is organised by Dr Ranjini Kaushik. She talks to us about the importance of inclusivity and how sabhas can be more inclusive.",
    "time": "TNN / Dec 01, 2023, 12:15 (IST)",
    "article": "The event, which puts the spotlight on disabled artistes, is organised by Dr Ranjini Kaushik. She talks to us about the importance of inclusivity and how sabhas can be more inclusive."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/government-puts-anganwadi-workers-on-the-frontline-to-identify-track-children-with-disabilities/articleshow/105576122.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105576122,width-300,resizemode-4/105576122.jpg",
    "title": "Government puts 'anganwadi' workers on the frontline to identify & track children with disabilities  Government puts 'anganwadi' workers on the frontline to identify & track children with disabilities  The Centre launched the 'Anganwadi protocol' to identify disabilities in children and connect them to interventions. This protocol, focused on children with disabilities, provides training for anganwadi workers. The workers use the Poshan Tracker app to collect data and track the children. All children will be assessed for developmental delays and referred to ASHA and ANM. The protocol also supports families and encourages integration of children with disabilities into mainstream schools. Anganwadi centres will adopt a multi-sensory and toy-based approach to cater to different needs.",
    "time": "TNN / Nov 29, 2023, 07:16 (IST)",
    "article": "The Centre launched the 'Anganwadi protocol' to identify disabilities in children and connect them to interventions. This protocol, focused on children with disabilities, provides training for anganwadi workers. The workers use the Poshan Tracker app to collect data and track the children. All children will be assessed for developmental delays and referred to ASHA and ANM. The protocol also supports families and encourages integration of children with disabilities into mainstream schools. Anganwadi centres will adopt a multi-sensory and toy-based approach to cater to different needs."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/jaipur/polling-peaceful-barring-stray-incidents-of-violence-in-state/articleshow/105506307.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105506307,width-300,resizemode-4/105506307.jpg",
    "title": "Polling peaceful barring stray incidents of violence in state  Polling peaceful barring stray incidents of violence in state",
    "time": "TNN / Nov 26, 2023, 08:33 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/disability-commissioner-asks-jnu-administration-to-look-into-accessibility-issues-on-campus/articleshow/105458182.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105458182,width-300,resizemode-4/105458182.jpg",
    "title": "Disability commissioner asks JNU administration to look into accessibility issues on campus  Disability commissioner asks JNU administration to look into accessibility issues on campus  The ministry of social justice and empowerment has asked Jawaharlal Nehru University to address the accessibility issues faced by students with disabilities on campus. The court of the chief commissioner for persons with disabilities (PwD) issued a letter to JNU after a report highlighted the campus's lack of disability-friendly infrastructure. The letter emphasizes the right to free movement for people with disabilities and cites the Rights of Persons with Disabilities Act, 2016, which mandates the government to provide a suitable environment and reasonable accommodation for persons with disabilities. The ministry also reminds educational institutions of their responsibility to make their buildings and facilities accessible under the Act.",
    "time": "TNN / Nov 24, 2023, 07:15 (IST)",
    "article": "The ministry of social justice and empowerment has asked Jawaharlal Nehru University to address the accessibility issues faced by students with disabilities on campus. The court of the chief commissioner for persons with disabilities (PwD) issued a letter to JNU after a report highlighted the campus's lack of disability-friendly infrastructure. The letter emphasizes the right to free movement for people with disabilities and cites the Rights of Persons with Disabilities Act, 2016, which mandates the government to provide a suitable environment and reasonable accommodation for persons with disabilities. The ministry also reminds educational institutions of their responsibility to make their buildings and facilities accessible under the Act."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/disability-rights-bodies-slam-a-raja/articleshow/103522693.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-103522693,width-300,resizemode-4/103522693.jpg",
    "title": "Disability rights bodies slam A Raja  Disability rights bodies slam A Raja  Disability rights organisations have objected to DMK MP A Raja's remarks equating Sanatan Dharma with HIV and leprosy. The Leprosy Mission Trust India, in a letter to Raja, has asked him to reconsider his statement and \"publicly apologise for any harm caused\".",
    "time": "TNN / Sep 09, 2023, 06:52 (IST)",
    "article": "Disability rights organisations have objected to DMK MP A Raja's remarks equating Sanatan Dharma with HIV and leprosy. The Leprosy Mission Trust India, in a letter to Raja, has asked him to reconsider his statement and \"publicly apologise for any harm caused\"."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/challenges-faced-by-students-with-disabilities-in-delhi-university-campus-law-centre/articleshow/105303743.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Ground reality: From getting there to being on campus, it’s a daily challenge  Ground reality: From getting there to being on campus, it’s a daily challenge  Students with disabilities at Delhi University's Campus Law Centre face numerous challenges due to the campus infrastructure. The entrance lacks tactile flooring and indicators, making it difficult for visually impaired and wheelchair users to navigate. The college also lacks designated parking spaces and has inadequate facilities for disabled individuals. Additionally, there are accessibility issues with classrooms, restrooms, and case materials. Despite a court order to implement accessibility guidelines, the college has yet to address these issues fully. Renovations have been made, but infrastructural problems, such as broken facilities and nonfunctional lifts, remain.",
    "time": "TNN / Nov 18, 2023, 08:10 (IST)",
    "article": "Students with disabilities at Delhi University's Campus Law Centre face numerous challenges due to the campus infrastructure. The entrance lacks tactile flooring and indicators, making it difficult for visually impaired and wheelchair users to navigate. The college also lacks designated parking spaces and has inadequate facilities for disabled individuals. Additionally, there are accessibility issues with classrooms, restrooms, and case materials. Despite a court order to implement accessibility guidelines, the college has yet to address these issues fully. Renovations have been made, but infrastructural problems, such as broken facilities and nonfunctional lifts, remain."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/mumbai/official-suspended-for-sending-disabled-woman-to-2nd-floor/articleshow/104741055.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104741055,width-300,resizemode-4/104741055.jpg",
    "title": "Official suspended for sending disabled woman to 2nd floor  Official suspended for sending disabled woman to 2nd floor  A marriage registrar in Maharashtra, India has been suspended after a disability rights activist, Virali Modi, had to be carried up two flights of stairs to register her marriage. The registrar, Arun Ghodekar, allegedly refused to come down to collect Modi's signature, stating that he needed his computer to complete the registration process. The state government has suspended Ghodekar pending a full inquiry, while Modi has called for greater accessibility in public buildings.",
    "time": "TNN / Oct 27, 2023, 08:14 (IST)",
    "article": "A marriage registrar in Maharashtra, India has been suspended after a disability rights activist, Virali Modi, had to be carried up two flights of stairs to register her marriage. The registrar, Arun Ghodekar, allegedly refused to come down to collect Modi's signature, stating that he needed his computer to complete the registration process. The state government has suspended Ghodekar pending a full inquiry, while Modi has called for greater accessibility in public buildings."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/lucknow/up-is-the-only-state-in-country-to-have-2-varsities-for-disabled-cm/articleshow/105712741.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105712741,width-300,resizemode-4/105712741.jpg",
    "title": "UP is the only state in country to have 2 varsities for disabled: CM  UP is the only state in country to have 2 varsities for disabled: CM  Chief Minister Yogi Adityanath stated that Uttar Pradesh has two universities for physically challenged people, DSMNRU and Jagatguru Divyang University. The state invested Rs 1,120 crore in disabled welfare schemes. Para-athletes in China won 111 medals, demonstrating the talent of divyang people. The government has established three shelter homes for the mentally challenged and plans to open six more. Monthly pension for disabled persons has been increased to Rs 1,000, and leprosy sufferers now receive Rs 3,000. The government has distributed artificial limbs, motorized tricycles, and provided marriage incentives. Financial assistance of up to Rs 6 lakh is offered for cochlear implant surgery.",
    "time": "TNN / Dec 04, 2023, 08:23 (IST)",
    "article": "Chief Minister Yogi Adityanath stated that Uttar Pradesh has two universities for physically challenged people, DSMNRU and Jagatguru Divyang University. The state invested Rs 1,120 crore in disabled welfare schemes. Para-athletes in China won 111 medals, demonstrating the talent of divyang people. The government has established three shelter homes for the mentally challenged and plans to open six more. Monthly pension for disabled persons has been increased to Rs 1,000, and leprosy sufferers now receive Rs 3,000. The government has distributed artificial limbs, motorized tricycles, and provided marriage incentives. Financial assistance of up to Rs 6 lakh is offered for cochlear implant surgery."
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/new-scheme-to-offer-free-equipment-to-the-disabled/articleshow/104823291.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104823291,width-300,resizemode-4/104823291.jpg",
    "title": "New scheme to offer free equipment to the disabled  New scheme to offer free equipment to the disabled  The Delhi government is set to provide free equipment to people with disabilities under the Sugamya Sahayak Yojana. The social welfare department has compiled a list of 20 types of equipment, including motorised tricycles and artificial limbs. The government has finalised an agreement with the Artificial Limbs Manufacturing Corporation Of India and allocated a budget of over Rs 10 crore for the purchase of the equipment. The distribution will take place through camps held in each administrative district of Delhi. The scheme will be launched in November and will cover 40% or more disabled individuals.",
    "time": "TNN / Oct 30, 2023, 15:28 (IST)",
    "article": "The Delhi government is set to provide free equipment to people with disabilities under the Sugamya Sahayak Yojana. The social welfare department has compiled a list of 20 types of equipment, including motorised tricycles and artificial limbs. The government has finalised an agreement with the Artificial Limbs Manufacturing Corporation Of India and allocated a budget of over Rs 10 crore for the purchase of the equipment. The distribution will take place through camps held in each administrative district of Delhi. The scheme will be launched in November and will cover 40% or more disabled individuals."
  },
  {
    "link": "https://timesofindia.indiatimes.com/life-style/parenting/attention-please-why-parents-shouldnt-get-hyper-about-adhd/articleshow/104618112.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104618112,width-300,resizemode-4/104618112.jpg",
    "title": "ATTENTION PLEASE! Why parents shouldn’t get hyper about ADHD  ATTENTION PLEASE! Why parents shouldn’t get hyper about ADHD",
    "time": "TNN / Oct 22, 2023, 08:18 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/mumbai/no-lift-at-khar-office-disabled-activist-carried-up-2-floors-to-register-marriage/articleshow/104540601.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104540601,width-300,resizemode-4/104540601.jpg",
    "title": "No lift at Khar office, disabled activist carried up 2 floors to register marriage  No lift at Khar office, disabled activist carried up 2 floors to register marriage  A disability rights activist in Mumbai had to be carried up two flights of stairs to register her marriage due to the lack of infrastructure for disabled persons in government offices. The incident highlighted the struggles faced by cash-starved PSUs in meeting basic requirements for accessibility. The activist questioned the effectiveness of the Centre's Accessible India campaign. The sub-registrar's office where the incident occurred is in a building belonging to MTNL, which is under dissolution and lacks a working lift. The incident raised discussions on the impact of the term 'divyang' on the lives of disabled citizens.",
    "time": "TNN / Oct 19, 2023, 08:14 (IST)",
    "article": "A disability rights activist in Mumbai had to be carried up two flights of stairs to register her marriage due to the lack of infrastructure for disabled persons in government offices. The incident highlighted the struggles faced by cash-starved PSUs in meeting basic requirements for accessibility. The activist questioned the effectiveness of the Centre's Accessible India campaign. The sub-registrar's office where the incident occurred is in a building belonging to MTNL, which is under dissolution and lacks a working lift. The incident raised discussions on the impact of the term 'divyang' on the lives of disabled citizens."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/disabled-woman-carried-up-to-marriage-registrars-second-floor-office-as-building-has-no-lift-how-is-this-fair-she-asks/articleshow/104553870.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Disabled woman carried up to marriage registrar's second-floor office as building has no lift; how is this fair, she asks  Disabled woman carried up to marriage registrar's second-floor office as building has no lift; how is this fair, she asks",
    "time": "PTI / Oct 19, 2023, 16:01 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/goa/atrocity-to-confine-disabled-people-at-home-phal-desai/articleshow/104764446.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Atrocity to confine disabled people at home: Phal Desai  Atrocity to confine disabled people at home: Phal Desai",
    "time": "TNN / Oct 27, 2023, 04:38 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/sports/cricket/news/rajasthan-royals-and-dcci-set-to-organise-3rd-national-physical-disability-t20-cricket-championship/articleshow/103808622.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "Rajasthan Royals and DCCI set to organise 3rd National Physical Disability T20 Cricket Championship  Rajasthan Royals and DCCI set to organise 3rd National Physical Disability T20 Cricket Championship  The Rajasthan Royals have announced their partnership with the Differently Abled Cricket Council of India (DCCI) to organize the 3rd National Physical Disability T20 Cricket Championship. The competition, set to be the largest cricket tournament for physically disabled cricketers, will feature over 400 Divyang cricketers representing 24 state teams. The tournament aims to empower the players and raise awareness about inclusivity in sports. The matches will be held in Udaipur over 11 days, with free entry for spectators. The Royals' CEO expressed their commitment to using cricket for social change, while the DCCI thanked them for their support.",
    "time": "TNN / Sep 20, 2023, 15:32 (IST)",
    "article": "The Rajasthan Royals have announced their partnership with the Differently Abled Cricket Council of India (DCCI) to organize the 3rd National Physical Disability T20 Cricket Championship. The competition, set to be the largest cricket tournament for physically disabled cricketers, will feature over 400 Divyang cricketers representing 24 state teams. The tournament aims to empower the players and raise awareness about inclusivity in sports. The matches will be held in Udaipur over 11 days, with free entry for spectators. The Royals' CEO expressed their commitment to using cricket for social change, while the DCCI thanked them for their support."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/govt-plans-push-to-help-india-become-hub-of-assistive-tech-for-disabled/articleshow/102811327.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-78553754,width-300,resizemode-4/78553754.jpg",
    "title": "Govt plans push to help India become hub of assistive tech for disabled  Govt plans push to help India become hub of assistive tech for disabled",
    "time": "TNN / Aug 17, 2023, 22:10 (IST)",
    "article": ""
  },
  {
    "link": "https://timesofindia.indiatimes.com/city/delhi/hc-to-pwd-even-a-healthy-person-cant-use-foot-bridge-forget-disabled/articleshow/105739274.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-105739274,width-300,resizemode-4/105739274.jpg",
    "title": "Delhi HC to PWD: ‘Even a healthy person can’t use foot bridge, forget disabled’  Delhi HC to PWD: ‘Even a healthy person can’t use foot bridge, forget disabled’  Delhi High Court criticizes the poor condition of foot overbridges (FOBs) in Delhi, stating that they are unusable even for healthy individuals. The court orders the Public Works Department (PWD) to immediately repair over 100 FOBs. The court questions the lack of responsibility and periodic maintenance, and asks if liability has been fixed on erring officials. The PWD assures the court that 110 FOBs will be made fully functional and disabled-friendly by June 30 next year.",
    "time": "TNN / Dec 05, 2023, 07:15 (IST)",
    "article": "Delhi High Court criticizes the poor condition of foot overbridges (FOBs) in Delhi, stating that they are unusable even for healthy individuals. The court orders the Public Works Department (PWD) to immediately repair over 100 FOBs. The court questions the lack of responsibility and periodic maintenance, and asks if liability has been fixed on erring officials. The PWD assures the court that 110 FOBs will be made fully functional and disabled-friendly by June 30 next year."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/sc-is-now-more-accessible-with-a-sign-language-interpreter/articleshow/104226390.cms",
    "img": "https://static.toiimg.com/photo/25581306.cms",
    "title": "SC is now more accessible with a sign language interpreter  SC is now more accessible with a sign language interpreter  Disability rights advocates assert that the Supreme Court's decision to appoint a sign language interpreter will enhance inclusivity and accessibility within the judicial system. This move is seen as a commitment to ensuring that every voice is acknowledged, every word comprehended, and every right upheld.",
    "time": "PTI / Oct 07, 2023, 05:28 (IST)",
    "article": "Disability rights advocates assert that the Supreme Court's decision to appoint a sign language interpreter will enhance inclusivity and accessibility within the judicial system. This move is seen as a commitment to ensuring that every voice is acknowledged, every word comprehended, and every right upheld."
  },
  {
    "link": "https://timesofindia.indiatimes.com/india/new-disability-pension-rules-will-prevent-misuse-chief-of-defence-staff-anil-chauhan/articleshow/104224095.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104224095,width-300,resizemode-4/104224095.jpg",
    "title": "New disability pension rules will prevent misuse: Chief of Defence Staff Anil Chauhan  New disability pension rules will prevent misuse: Chief of Defence Staff Anil Chauhan  The recent tightening of disability pension rules for the armed forces aims to prevent misuse and ensure a fitter military, according to Chief of Defence Staff General Anil Chauhan. The revised rules, which will be applicable to personnel retiring after September 21, 2023, do not affect the emoluments of war widows, family pensioners, or veterans.",
    "time": "TNN / Oct 07, 2023, 03:16 (IST)",
    "article": "The recent tightening of disability pension rules for the armed forces aims to prevent misuse and ensure a fitter military, according to Chief of Defence Staff General Anil Chauhan. The revised rules, which will be applicable to personnel retiring after September 21, 2023, do not affect the emoluments of war widows, family pensioners, or veterans."
  },
  {
    "link": "https://timesofindia.indiatimes.com/business/startups/people/accessibility-inclusion-ai-for-people-with-disabilities/articleshow/104032520.cms",
    "img": "https://static.toiimg.com/thumb/imgsize-123456,msid-104032520,width-300,resizemode-4/104032520.jpg",
    "title": "Accessibility & inclusion: AI for people with disabilities  Accessibility & inclusion: AI for people with disabilities",
    "time": "Sep 29, 2023, 09:39 (IST)",
    "article": ""
  }
]
